Core/src/Documents/СписаниеТопливаЗапасов/СписаниеТопливаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТопливаЗапасов</name>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаОСиТС</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоРасходуТС</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеТопливаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСДатойДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегОкончание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегРазница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйБак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/СписаниеТопливаЗапасов/Forms/ФормаНастройкиЧтенияТабличногоДокумента/Module.bsl
&НаКлиенте
Процедура ДабавитьКолонку(Команда)
	
	ДабавитьКолонкНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДабавитьКолонкНаСервере(СписокКолонок = Неопределено)
	
	Если СписокКолонок = Неопределено Тогда
		
		КоличествоКолонок = КоличествоКолонок + 1;
		
		НовыеРеквизиты = Новый Массив;
		
		НовыйРеквизит = Новый РеквизитФормы("Колонка" + КоличествоКолонок, Новый ОписаниеТипов("Строка"),, НСтр("ru = 'Колонка " + КоличествоКолонок + "'; ka = 'სვეტი " + КоличествоКолонок + "'"));
		
		НовыеРеквизиты.Добавить(НовыйРеквизит);
		ИзменитьРеквизиты(НовыеРеквизиты);
		
		НовыйЭлемент = Элементы.Вставить("Колонка" + КоличествоКолонок, Тип("ПолеФормы"), Элементы.ГруппаКолонок);
		НовыйЭлемент.ПутьКДанным = "Колонка" + КоличествоКолонок;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "КолонкиНачалоВыбора");
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "КолонкиПриИзменении");
		
		Элементы["Колонка" + КоличествоКолонок].КнопкаВыбора = Истина;
		Элементы["Колонка" + КоличествоКолонок].КнопкаОчистки = Истина;
		Элементы["Колонка" + КоличествоКолонок].РежимВыбораИзСписка = Истина;
		
	Иначе
		
		Для Каждого ЭлементСписка Из СписокКолонок Цикл 
			
			НовыеРеквизиты = Новый Массив;
			
			НомерКолонки = СокрЛП(СтрЗаменить(Строка(ЭлементСписка.Значение), "Колонка", ""));
			
			НомерКолонкиЧисло = КоличествоКолонок;
			Попытка
				НомерКолонкиЧисло = Число(НомерКолонки);
				КоличествоКолонок = ?(НомерКолонкиЧисло > КоличествоКолонок, НомерКолонкиЧисло, КоличествоКолонок);
			Исключение
			КонецПопытки;
			
			НовыйРеквизит = Новый РеквизитФормы(ЭлементСписка.Значение, Новый ОписаниеТипов("Строка"),, НСтр("ru = 'Колонка " + НомерКолонки + "'; ka = 'სვეტი " + НомерКолонки + "'"));
			
			НовыеРеквизиты.Добавить(НовыйРеквизит);
			ИзменитьРеквизиты(НовыеРеквизиты);
			
			НовыйЭлемент = Элементы.Вставить(ЭлементСписка.Значение, Тип("ПолеФормы"), Элементы.ГруппаКолонок);
			НовыйЭлемент.ПутьКДанным = ЭлементСписка.Значение;
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "КолонкиНачалоВыбора");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "КолонкиПриИзменении");
			
			Элементы[ЭлементСписка.Значение].КнопкаВыбора = Истина;
			Элементы[ЭлементСписка.Значение].КнопкаОчистки = Истина;
			Элементы[ЭлементСписка.Значение].РежимВыбораИзСписка = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокИменКолонок.Очистить();
	СписокИменКолонок.Вставить(0,"Дата",НСтр("ka='თარიღი';ru='Дата'"));
	СписокИменКолонок.Вставить(1,"ВнеоборотныйАктив",НСтр("ru = 'ОС/Транспортне средство'; ka = 'ძ/ს / სატრანსპორტო საშუალება'"));
	СписокИменКолонок.Вставить(2,"Номенклатура",НСтр("ka='ნომენკლატურა';ru='Номенклатура'"));
	СписокИменКолонок.Вставить(3,"Характеристика",НСтр("ka='მახასიათებელი';ru='Характеристика'"));
	СписокИменКолонок.Вставить(4,"Количество",НСтр("ka='რაოდენობა';ru='Количество'"));
	СписокИменКолонок.Вставить(5,"СтруктурнаяЕдиница",НСтр("ka='საწყობი';ru='Склад'"));
	СписокИменКолонок.Вставить(6,"Подразделение",НСтр("ka='ქვეგანყოფილება';ru='Подразделение'"));
	СписокИменКолонок.Вставить(7,"НаправлениеДеятельности",НСтр("ka='საქმიანობის მიმართულება';ru='Направление деятельности'"));
	СписокИменКолонок.Вставить(8,"СчетУчетаЗатрат",НСтр("ka='ხარჯების ანგარიში (რეგლ)';ru='Счет учета затрат (регл)'"));
	
	Если Параметры.Свойство("ЭтоТопливо") И Параметры.ЭтоТопливо Тогда 
		СписокИменКолонок.Вставить(9,"ПробегНачало",НСтр("ru = 'Пробег начало'; ka = 'ოდომეტრის ჩვენება საწყისი'"));
		СписокИменКолонок.Вставить(10,"ПробегОкончание",НСтр("ru = 'Пробег окончание'; ka = 'ოდომეტრის ჩვენება საბოლოო'"));
		СписокИменКолонок.Вставить(11,"ПробегРазница",НСтр("ru = 'Пробег (км)'; ka = 'გავლილი კილომეტრაჟი'"));
		СписокИменКолонок.Вставить(12,"ПолныйБак",НСтр("ru = 'Полный бак'; ka = 'ავზი გაივსო'"));
	КонецЕсли;
	
	КоличествоКолонок = 0;
	
	Если Параметры.Свойство("СписокКолонок") Тогда 
		
		СписокВходящий = Параметры.СписокКолонок;
		ДабавитьКолонкНаСервере(Параметры.СписокКолонок);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КолонкиНачалоВыбора(Элемент)
	
	а=1;
	КолонкиНачалоВыбораНаСервере();
	
	СписокЗагрузки = СписокИменКолонок.Скопировать();
	МассивВыбранныхКолонко = Новый Массив;
	
	Для Сч = 1 По 14 Цикл
		
		Если Элемент.Имя = "Колонка"+Сч Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			ИскомоеЗначение	= ЭтаФорма["Колонка"+Сч];
			НайденныйЭлемент = СписокЗагрузки.НайтиПоЗначению(ИскомоеЗначение);
			Если НайденныйЭлемент <> Неопределено Тогда 
				СписокЗагрузки.Удалить(НайденныйЭлемент);
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;             
		
	КонецЦикла;
	
	Элемент.СписокВыбора.Очистить();
	
	Для Каждого Элем Из СписокЗагрузки Цикл 
		
		Элемент.СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КолонкиНачалоВыбораНаСервере()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	СтруктураКолонок = Новый Структура;
	
	Для Сч = 1 По 14 Цикл
		
		Попытка
			ИскомоеЗначение	= ЭтаФорма["Колонка"+Сч];
			СтруктураКолонок.Вставить("Колонка"+Сч, ИскомоеЗначение);
		Исключение
			Продолжить;
		КонецПопытки;             
		
	КонецЦикла;
	
	Оповестить("НастройкаЗагрузкиИзТабличногоДокумента_СпианиеТопливаЗапасов",СтруктураКолонок);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КолонкиПриИзменении(Элемент)
	
	а=1;             
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ЭлементСписка Из СписокВходящий Цикл 
		
		Для Каждого Элем Из СписокИменКолонок Цикл 
			
			Элементы[ЭлементСписка.Значение].СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
			
		КонецЦикла;
		
		Если ЭлементСписка.Представление <> "" Тогда 
			ЭтаФорма[ЭлементСписка.Значение] = Элементы[ЭлементСписка.Значение].СписокВыбора.НайтиПоЗначению(ЭлементСписка.Представление).Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура СохранитьШаблонНаСервере(ТабДок, МассивИменКолонок)
	
	Счетчик = 1;
	Для Каждого Элем Из МассивИменКолонок Цикл 
		
		//ТабДок.ПолучитьОбласть("R1C"+Счетчик+":R1C"+Счетчик+"").ТекущаяОбласть.Текст = Элем;
		ТабДок.Область("R1C"+Формат(Счетчик,"ЧГ=0")).Текст = Элем;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьШаблон(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	МассивИменКолонок = Новый Массив;
	
	Для Сч = 1 По 14 Цикл
		
		Попытка
			ИскомоеЗначение	= СписокИменКолонок.НайтиПоЗначению(ЭтаФорма["Колонка"+Сч]).Представление;
			МассивИменКолонок.Добавить(ИскомоеЗначение);
		Исключение
			Продолжить;
		КонецПопытки;             
		
	КонецЦикла;
	
	СохранитьШаблонНаСервере(ТабДок, МассивИменКолонок);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    ДиалогВыбораФайла.ПолноеИмяФайла = НСтр("ru = 'Шаблон загрузки'; ka = 'Шаблон загрузки'");
    Фильтр = "Табличный документ (*.xlsx)|*.xlsx|";
    ДиалогВыбораФайла.Фильтр = Фильтр;
    ДиалогВыбораФайла.Заголовок = "Укажите Место";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
        ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
		ТабДок.Записать(ДиалогВыбораФайла.ПолноеИмяФайла, "XLSX"); 
	КонецЕсли;
	
КонецПроцедуры
